# Operation 3: Performing merge operation in pandas (equal to join operation in database)

In [1]:
import numpy as np
import pandas as pd

In [2]:
datasetDF = pd.read_csv("Output of dupliactes removed file.csv")

In [3]:
datasetDF

,Eid,Ename,Esalary,EsalaryYearly,updatedMonthlySalary,updatedSalaryYearly,Dept,area of working
0,1,Aravind,1000,12000,1100.0,13200.0,HR,Bangalore
1,2,Sharada,2000,24000,2100.0,25200.0,Design,Hyderabad
2,3,Rachael,2000,24000,2100.0,25200.0,Operation,Bangalore
3,4,Dave,2000,24000,2100.0,25200.0,PMG,Hyderabad
4,5,Rhema,9878,118536,9878.0,118536.0,Delivery,Chennai
5,6,Rachael,9999,119988,9999.0,119988.0,Testing,Kurnool

In [4]:
# we creATE A NEW ddf
dataExampleDF1 = pd.DataFrame([ [4,"QA"],[1,"HR"],[2,"Ops"],[3,"Dev"] ], columns=["Eid","Dept."])

In [5]:
dataExampleDF1

   Eid Dept.
0    4    QA
1    1    HR
2    2   Ops
3    3   Dev

In [6]:
# whatever way we have created, same way it is displayed, deliberately it has taken.

In [13]:
dataExampleDF2 = pd.DataFrame([ [1,"Sharada"],[2,"Aaradhya"],[3,"Abhishek"] ], columns=["Eid","Ename"])

In [14]:
dataExampleDF2

   Eid     Ename
0    1   Sharada
1    2  Aaradhya
2    3  Abhishek

In [15]:
# from above 2 tables, common column is Eid.

In [16]:
# Task 1: I want to join above two datasets logically on the basis of Eid

In [17]:
# when you have common column in both tables, merge option will be used.

In [18]:
pd.merge(dataExampleDF1,dataExampleDF2)

   Eid Dept.     Ename
0    1    HR   Sharada
1    2   Ops  Aaradhya
2    3   Dev  Abhishek

In [19]:
# common items only will be displayed.

In [26]:
dataExampleDF3 = pd.DataFrame([ [4,"QA"],[1,"HR"],[2,"Ops"],[3,"Dev"] ], columns=["Eid","Dept."])
dataExampleDF4 = pd.DataFrame([ [1,"Sharada"],[2,"Aaradhya"],[3,"Abhishek"] ], columns=["Empid","Ename"])

In [27]:
pd.merge(dataExampleDF3,dataExampleDF4)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [28]:
# becuase there is no common column, so megring will not happen.
# but, customised merging can be done
pd.merge(dataExampleDF3,dataExampleDF4, left_on="Eid" , right_on="Empid")

   Eid Dept.  Empid     Ename
0    1    HR      1   Sharada
1    2   Ops      2  Aaradhya
2    3   Dev      3  Abhishek

In [29]:
# only two tables can be merged. the resultant DF can be merged with another tablet.

# concat operation

In [30]:
dataEmpDF1 = pd.DataFrame([ [1,"Sharada"],[2,"Aaradhya"],[3,"Abhishek"] ], columns=["Eid","Ename"])
dataEmpDF2 = pd.DataFrame([ [4,"Aravind"],[5,"Aounnathya"],[6,"Robo"] ], columns=["Eid","Ename"])

In [32]:
resultEmpDF = pd.concat( [dataEmpDF1,dataEmpDF2] , axis=0) # axis=0 means row concat

In [33]:
resultEmpDF

   Eid       Ename
0    1     Sharada
1    2    Aaradhya
2    3    Abhishek
0    4     Aravind
1    5  Aounnathya
2    6        Robo

In [34]:
# In many operations, indexing is the challenging as it requires reset index.

In [35]:
# many number of DFs/tables can be concatnated , but in merge operation only two DF can be merged.

### column wise concatnation

In [37]:
dataEmpDF3 = pd.DataFrame([ [4,"QA"],[1,"HR"],[2,"Ops"],[3,"Dev"] ], columns=["Eid","Dept."])
dataEmpDF4 = pd.DataFrame([ [1,"Sharada"],[2,"Aaradhya"],[3,"Abhishek"] ], columns=["Empid","Ename"])

In [39]:
resultEmpDF2 = pd.concat( [dataEmpDF3,dataEmpDF4] , axis=1) # axis=1 for columnwise concat
resultEmpDF2

   Eid Dept.  Empid     Ename
0    4    QA    1.0   Sharada
1    1    HR    2.0  Aaradhya
2    2   Ops    3.0  Abhishek
3    3   Dev    NaN       NaN

In [ ]:
# Empid is float here , its by default

In [40]:
# if there is a relationship between DF1 and DF2 , then cancat can not be used 
# here merge should be used.

In [41]:
# concat will not help you about relationship of Two DFs
# just it will paste the data at one place.
# if we are looking for Primary key and foreign key relationship concept ,such senerio can concat cn not be used

In [42]:
# column concat done based on row indexing

In [43]:
resultEmpDF2 = pd.concat( [dataEmpDF3,dataEmpDF4]) 
resultEmpDF2

   Eid Dept.  Empid     Ename
0  4.0    QA    NaN       NaN
1  1.0    HR    NaN       NaN
2  2.0   Ops    NaN       NaN
3  3.0   Dev    NaN       NaN
0  NaN   NaN    1.0   Sharada
1  NaN   NaN    2.0  Aaradhya
2  NaN   NaN    3.0  Abhishek